app/views/farms/index.html.erb

SELECT "farms".* FROM "farms" WHERE "farms"."user_id" = ?  [["user_id", 2]]
---

  <% if current_user.farms.present? %>