app/views/plague_reports/index.html.erb

SELECT "plague_reports".* FROM "plague_reports" WHERE "plague_reports"."groove_id" = ?  [["groove_id", 1]]
---
  <h1>Reportes de Plagas del Surco <%= @groove.id %></h1>
  <% if @groove.plague_reports.present?  %>