app/controllers/farms_controller.rb

INSERT INTO "farms" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Mi granjita"], ["created_at", "2018-04-21 16:23:08.498415"], ["updated_at", "2018-04-21 16:23:08.498415"], ["user_id", 2]]
---
  def create
    @farm = current_user.farms.new(farm_params)

    respond_to do |format|
      if @farm.save

UPDATE "farms" SET "name" = ?, "updated_at" = ? WHERE "farms"."id" = ?  [["name", "Micultivo"], ["updated_at", "2018-05-21 11:32:58.249255"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @farm.update(farm_params)

DELETE FROM "farms" WHERE "farms"."id" = ?  [["id", 5]]
---
  def destroy
    @farm.destroy

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:id])