app/controllers/lots_controller.rb

SELECT  1 AS one FROM "lots" WHERE "lots"."key" = ? LIMIT ?  [["key", "xXn5of79"], ["LIMIT", 1]]
INSERT INTO "lots" ("name", "location", "farm_id", "created_at", "updated_at", "key") VALUES (?, ?, ?, ?, ?, ?)  [["name", "1"], ["location", "1"], ["farm_id", 1], ["created_at", "2018-05-21 19:22:32.653199"], ["updated_at", "2018-05-21 19:22:32.653199"], ["key", "aj5mu6YG"]]
---
  def create
    @lot = Lot.new(lot_params)
    loop do
      @lot.key = ([*('a'..'z'),*('A'..'Z'),*('0'..'9')]-%w()).sample(8).join
      break unless Lot.exists?(key: @lot.key)
    end

    respond_to do |format|
      if @lot.save

UPDATE "lots" SET "name" = ?, "location" = ?, "farm_id" = ?, "updated_at" = ? WHERE "lots"."id" = ?  [["name", "qLote de lechugas"], ["location", "Zona este de la granja11"], ["farm_id", 2], ["updated_at", "2018-05-23 14:32:19.603076"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @lot.update(lot_params)

DELETE FROM "lots" WHERE "lots"."id" = ?  [["id", 3]]
---
  def destroy
    @lot.destroy

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_lot
      @lot = Lot.find(params[:id])

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_farm
      @farm = Farm.find(params[:farm_id])